# Task 4

In [69]:
import sqlite3

connection = sqlite3.connect("Data/books.db", timeout=10)

Section 1: SELECT

In [70]:
import pandas as pd

pd.read_sql("SELECT * from titles",connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

Section 2: WHERE

In [71]:
pd.read_sql("""SELECT * FROM titles WHERE copyright > '2017'""",connection)

         isbn                          title  edition copyright
0  0135404673  Intro to Python for CS and DS        1      2020
1  0134743350            Java How to Program       11      2018

In [72]:
pd.read_sql("""Select first,last from authors where last ='Deitel'""",connection)

    first    last
0    Paul  Deitel
1  Harvey  Deitel
2   Abbey  Deitel

In [73]:
pd.read_sql("""SELECT id, first, last
            FROM authors
            where first LIKE '_a%'""", 
            connection, index_col=["id"])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
4      Dan   Quirk

Section 3

In [74]:
pd.read_sql("SELECT title FROM titles ORDER BY title ASC", connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [75]:
pd.read_sql("""SELECT id,first,last
            FROM authors
            ORDER BY last,first""",
            connection, index_col=["id"])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [76]:
pd.read_sql("""SELECT id,first,last
            FROM authors
            ORDER BY last DESC, first ASC""", 
            connection, index_col=["id"])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

In [77]:
pd.read_sql("""SELECT isbn, title, edition, copyright
            FROM titles
            WHERE title LIKE '%How to Program'
            ORDER BY title""", 
            connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

Section 4: INNER JOIN

In [78]:
pd.read_sql("""SELECT first, last,author_ISBN.isbn
            FROM authors 
            INNER JOIN author_ISBN
             ON authors.id = author_ISBN.id
            INNER JOIN titles
              ON titles.isbn = author_ISBN.isbn
            ORDER BY last, first""", 
            connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

Section 5: INSERT INTO.

In [79]:
cursor = connection.cursor()

cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ("Uma", "Subramanian")""")
connection.commit()
cursor.close()

In [80]:
pd.read_sql("SELECT * FROM titles", 
            connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [81]:
pd.read_sql("Select * from authors", connection)

   id      first         last
0   1       Paul       Deitel
1   2     Harvey       Deitel
2   3      Abbey       Deitel
3   4        Dan        Quirk
4   5  Alexander         Wald
5   6        Uma  Subramanian

Section 6: UPDATE

In [82]:
cursor = connection.cursor()
cursor = cursor.execute("""UPDATE authors SET last='Selvan'
                        WHERE first='Uma'""")
cursor = cursor.execute(""" update titles set copyright=2010 where isbn='134289369'""")
connection.commit()
cursor.close()

In [83]:
pd.read_sql("SELECT * FROM titles", 
            connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [84]:
pd.read_sql("Select * from authors", connection)

   id      first    last
0   1       Paul  Deitel
1   2     Harvey  Deitel
2   3      Abbey  Deitel
3   4        Dan   Quirk
4   5  Alexander    Wald
5   6        Uma  Selvan

Section 7: DELETE FROM

In [86]:
cursor = connection.cursor()
cursor = cursor.execute("DELETE FROM authors WHERE first ='Uma'")
cursor = cursor.execute("Delete from titles where title like 'Osho%'")
connection.commit()
cursor.close()

In [87]:
pd.read_sql("Select * from authors", connection)

   id      first    last
0   1       Paul  Deitel
1   2     Harvey  Deitel
2   3      Abbey  Deitel
3   4        Dan   Quirk
4   5  Alexander    Wald

In [88]:
pd.read_sql("SELECT * FROM titles", 
            connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [89]:
cursor = connection.close()